public class ToyStore {

    /**
     * Магазин игрушек (Java)
     * Проект розыгрыша в магазине игрушек. 
     * Функционал содержит добавление новых игрушек и задания веса для выпадения игрушек.
     * 
     * Программа может использоваться в различных системах, поэтому необходимо разработать класс в виде конструктора.
     * Класс-конструктор принимает минимум 3 строки, содержащие три поля: id игрушки, текстовое название и частоту выпадения игрушки.
     * Из принятой строки id и частоты выпадения(веса) заполнить минимум три массива.
     * Используя API коллекцию: java.util.PriorityQueue добавить элементы в коллекцию.
     * Организовать общую очередь.
     * Вызвать Get 10 раз и записать результат в файл.
     * 
     */
    public static void main(String[] args) {
        
    }
}